; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v9 ?v10)
             (pred_8 ?v13 ?v4)
             (pred_12 ?v9 ?v4)
             (pred_10 ?v3 ?v9 )
	     (pred_5 ?v9)
             (pred_6 ?v8)
             (pred_11 ?v13)
             (pred_3 ?v4)
             (pred_9 ?v9)
             (pred_4 ?v13)
             (pred_1 ?v9)
             (pred_7 ))



(:action op_4
:parameters (?v2 ?v5 ?v12 ?v1)
:precondition (and (pred_6 ?v2) (pred_6 ?v5) (pred_11 ?v12) (pred_3 ?v1)
          (pred_2 ?v2 ?v5) (pred_8 ?v12 ?v1)
                   (pred_12 ?v5 ?v1) (pred_5 ?v2) 
                   (pred_9 ?v5) (pred_4 ?v12))
:effect (and  (pred_1 ?v5) (not (pred_9 ?v5))))


(:action op_5
:parameters (?v2 ?v6)
:precondition (and (pred_6 ?v2) (pred_6 ?v6)
               (pred_5 ?v2) (pred_2 ?v2 ?v6) (pred_1 ?v6))
:effect (and (pred_5 ?v6) (not (pred_5 ?v2))))

(:action op_2
:parameters (?v2 ?v12)
:precondition (and (pred_6 ?v2) (pred_11 ?v12) 
                  (pred_5 ?v2) (pred_10 ?v12 ?v2) (pred_7 ))
:effect (and (pred_4 ?v12)
   (not (pred_10 ?v12 ?v2)) (not (pred_7 ))))


(:action op_1
:parameters (?v2 ?v11 ?v7)
:precondition (and (pred_6 ?v2) (pred_11 ?v11) (pred_11 ?v7)
                  (pred_5 ?v2) (pred_4 ?v7) (pred_10 ?v11 ?v2))
:effect (and (pred_4 ?v11) (pred_10 ?v7 ?v2)
        (not (pred_4 ?v7)) (not (pred_10 ?v11 ?v2))))

(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_6 ?v2) (pred_11 ?v12) 
                  (pred_5 ?v2) (pred_4 ?v12))
:effect (and (pred_7 ) (pred_10 ?v12 ?v2) (not (pred_4 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_03 obj_11 obj_09 obj_04 obj_05 obj_18 obj_02 obj_10 obj_19 obj_15 obj_07 obj_13 obj_16 obj_20 obj_12 obj_08
    obj_21 obj_14 obj_17
    obj_22 obj_01 obj_06
    )

    (:init
       (pred_7)

       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_05)
       (pred_6 obj_18)
       (pred_6 obj_02)
       (pred_6 obj_10)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_6 obj_20)
       (pred_6 obj_12)
       (pred_6 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_14)
       (pred_3 obj_17)
       (pred_11 obj_22)
       (pred_11 obj_01)
       (pred_11 obj_06)

       (pred_2 obj_03 obj_05)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_11 obj_18)
       (pred_2 obj_11 obj_09)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_09 obj_04)
       (pred_2 obj_09 obj_11)
       (pred_2 obj_04 obj_10)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_05 obj_19)
       (pred_2 obj_05 obj_18)
       (pred_2 obj_05 obj_03)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_18 obj_02)
       (pred_2 obj_18 obj_11)
       (pred_2 obj_18 obj_05)
       (pred_2 obj_02 obj_07)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_18)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_19 obj_16)
       (pred_2 obj_19 obj_15)
       (pred_2 obj_19 obj_05)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_19)
       (pred_2 obj_07 obj_12)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_02)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_16 obj_20)
       (pred_2 obj_16 obj_19)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_20 obj_16)
       (pred_2 obj_12 obj_08)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_12)
       (pred_9 obj_04)
       (pred_9 obj_05)
       (pred_9 obj_02)
       (pred_12  obj_04 obj_21)
       (pred_12  obj_05 obj_14)
       (pred_12  obj_02 obj_17)
       (pred_1 obj_03)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_18)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_13)
       (pred_1 obj_16)
       (pred_1 obj_20)
       (pred_1 obj_12)
       (pred_1 obj_08)

       (pred_8  obj_22 obj_21)
       (pred_8  obj_01 obj_14)
       (pred_8  obj_06 obj_17)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_06 obj_13)
       (pred_5 obj_08)
    )

    (:goal (and
       (pred_10 obj_01 obj_20)
    ))
(:constraints
  (always (not (pred_5 obj_12)))
)
)

; plan
1. (op_5 obj_08 obj_13)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_13)
   goals met: 0 of 1
2. (op_5 obj_13 obj_07)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_07)
   goals met: 0 of 1
3. (op_5 obj_07 obj_15)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_20)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_20)
   goals met: 0 of 1
5. (op_5 obj_20 obj_16)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_16)
   goals met: 0 of 1
6. (op_2 obj_16 obj_01)
   deleted: (pred_10 obj_01 obj_16) (pred_7)
   added: (pred_4 obj_01)
   goals met: 0 of 1
7. (op_5 obj_16 obj_20)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_20)
   goals met: 0 of 1
8. (op_3 obj_20 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_7) (pred_10 obj_01 obj_20)
   goals met: 1 of 1
